Real life example for fully understanding a very important concept of broadcasting in dataframes and series

In [13]:
import numpy as np
import pandas as pd

nba_data = {
    "Name" : ["Averay Bradley", "Jae Crawder", "John Holland"],
    "Team" : ["Boston Leltics", "Boston Leltics", "Boston Leltics"],
    "Number" : [0.0, 99.0, 30.0],
    "Position" : ["PG", "SF", "SG"],
    "Age" : [25.0, 25.0, 27.0],
    "Height" : ["6-2", "6-6", "6-5"],
    "Weight" : [180.0, 135.0, 205.0],
    "College" : ["Texas", "Marquette", "Boston University"],
    "Salary" : [7743232.0, 33422.0, np.nan]
}

In [14]:
nba_data

{'Name': ['Averay Bradley', 'Jae Crawder', 'John Holland'],
 'Team': ['Boston Leltics', 'Boston Leltics', 'Boston Leltics'],
 'Number': [0.0, 99.0, 30.0],
 'Position': ['PG', 'SF', 'SG'],
 'Age': [25.0, 25.0, 27.0],
 'Height': ['6-2', '6-6', '6-5'],
 'Weight': [180.0, 135.0, 205.0],
 'College': ['Texas', 'Marquette', 'Boston University'],
 'Salary': [7743232.0, 33422.0, nan]}

In [15]:
nba_df = pd.DataFrame(nba_data)

In [16]:
nba_df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Averay Bradley,Boston Leltics,0.0,PG,25.0,6-2,180.0,Texas,7743232.0
1,Jae Crawder,Boston Leltics,99.0,SF,25.0,6-6,135.0,Marquette,33422.0
2,John Holland,Boston Leltics,30.0,SG,27.0,6-5,205.0,Boston University,NaN

In [17]:
nba_df["Age"] += 10

In [18]:
nba_df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Averay Bradley,Boston Leltics,0.0,PG,35.0,6-2,180.0,Texas,7743232.0
1,Jae Crawder,Boston Leltics,99.0,SF,35.0,6-6,135.0,Marquette,33422.0
2,John Holland,Boston Leltics,30.0,SG,37.0,6-5,205.0,Boston University,NaN

In [19]:
10 + np.nan

nan

In [23]:
nba_df["Weight in Kilograms"] = nba_df["Weight"] / 2.205

In [24]:
nba_df

,Name,Team,Number,Position,Age,Height,Weight,College,Salary,Weight in Kilograms
0,Averay Bradley,Boston Leltics,0.0,PG,35.0,6-2,180.0,Texas,7743232.0,81.632653
1,Jae Crawder,Boston Leltics,99.0,SF,35.0,6-6,135.0,Marquette,33422.0,61.224490
2,John Holland,Boston Leltics,30.0,SG,37.0,6-5,205.0,Boston University,NaN,92.970522